---
kind: type
id: T:Autodesk.Revit.DB.FilledRegionType
source: html/850ae173-379b-bfd6-7295-3950ccc229ca.htm
---
# Autodesk.Revit.DB.FilledRegionType

A filled region attributes element.
 Note, the forground pattern color is stored in the parent class

## Syntax (C#)
```csharp
public class FilledRegionType : LineAndTextAttrSymbol
```